---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.NumberOfMeasurements
source: html/9808a841-ce1f-81df-9844-e4ad5db0431e.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.NumberOfMeasurements Property

Stores the total number of measurements

## Syntax (C#)
```csharp
public int NumberOfMeasurements { get; }
```

## Remarks
This number defines the length of value arrays in ValueAtPoint objects